Repository: steinm/pxdiff
Catalog: po/*.po
Languages: de

source: Not supported field type.
de: Not unterstützter Feldtyp.

source: %d fields changed.
de: %d geänderte Felder.

source: %s compares two paradox databases.
de: %s vergleicht zwei Paradox Datenbanken.

source: Usage: %s [OPTIONS] DATABASE1 DATABASE2 [PRIINDEX1 PRIINDEX2]
de: Aufruf: %s [OPTION] DATABASE1 DATABASE2 [PRIINDEX1 PRIINDEX2]

source: Options:
de: Optionen:

source: -h, --help this usage information.
de: -h, --help diese Hilfe.

source: --version show version information.
de: --version zeige Programmversion.

source: -v, --verbose be more verbose.
de: -v, --verbose mehr Informationen anzeigen

source: -d, --data compare data.
de: -d, --data vergleiche Datensätze

source: -t, --schema compare schema (default).
de: -t, --schema vergleiche Tabellenstuktur (Voreinstellung)

source: -s, --sort sort data before calculating difference.
de: -s, --sort sortiere Datensätze vor der Differenzenbildung.

source: --mode=MODE set compare mode (schema (default), data).
de: --mode=MODE setze Vergleichs-Modus (schema (voreingestellt), data)

source: --output-mode=MODE set output mode (plain (default), sql, stat).
de: --output-mode=MODE setze Ausgabe-Modus (plain (voreingestellt), sql, stat)

source: -o, --output-file=FILE output data into file instead of stdout.
de: -o, --output-file=DATEI schreibe Ausgabe in Datei statt nach stdout.

source: -k, --primary-key=FIELD use field as primary key.
de: -k, --primary-key=FELD Benutze Feld als Primärschlüssel.

source: -r, --recode=ENCODING sets the target encoding.
de: -r, --recode=ENCODING setzt Zielkodierung

source: --fields=REGEX extended regular expression to select fields.
de: --fields=REGEX erweiterter regulärer Ausdruck zur Auswahl von Feldern.

source: --compare-common compare only those fields common in both databases.
de: --compare-common vergleiche nur Felder, die in beiden Datenbanken sind.

source: --disregard-codepage different code pages will not prevent record comparision.
de: --disregard-codepage unterschiedliche code pages verhindern nicht den Vergleich der Datensätze.

source: --show-record-diff Show field differences within a record.
de: --show-record-diff Zeige Feldwertunterschiede innerhalb eines Datensatzes.

source: --use-gsf use gsf library to read input file.
de: --use-gsf benutze gsf-Bibliothek zum Lesen der Eingabedatei.

source: libpx uses librecode for recoding.
de: libpx benutzt librecode zum reencodieren.

source: libpx uses iconv for recoding.
de: libpx benutzt iconv zum reencodieren.

source: libpx has no support for recoding.
de: libpx unterstützt nicht das reencodieren.

source: libpx has been compiled for big endian architecture.
de: libpx wurde für Architekturen mit big endian übersetzt.

source: libpx has been compiled for little endian architecture.
de: libpx wurde für Architekturen mit little endian übersetzt.

source: libpx has gsf support: %s
de: libpx hat Unterstützung für die gsf-Bibliothek: %s

source: Yes
de: Ja

source: No
de: Nein

source: libpx has version: %d.%d.%d
de: libpx ist Version: %d.%d.%d

source: You must at least specify the files to compare.
de: Sie müssen mindestens die beiden zu vergleichenden Dateien angeben.

source: Could not open output file.
de: Konnte Ausgabedate nicht öffnen.

source: Could not create new paradox instance.
de: Konnte eine neue Paradox-Instanz nicht anlegen.

source: Could not open gsf input file.
de: Konnte Eingabedatei mit gsf-Bibliothek nicht öffnen.

source: Could not open input file.
de: Konnte Eingabedatei nicht öffnen.

source: Could not open first input file.
de: Konnte erste Eingabedatei nicht öffnen.

source: Could not open second input file.
de: Konnte zweite Eingabedatei nicht öffnen.

source: Could not open primary index to first file.
de: Konnte die Primärindexdatei nicht öffnen.

source: Could not read primary index to first file.
de: Konnte die Primärindexdatei der ersten Datei nicht lesen.

source: Could not add primary index to first file.
de: Konnte den Primärindex nicht der ersten Datei hinzufügen.

source: Could not open primary index to second file.
de: Konnte die Primärindexdatei der zweiten Datei nicht lesen.

source: Could not read primary index to second file.
de: Konnte die Primärindexdatei der zweiten Datei nicht lesen.

source: Could not add primary index to second file.
de: Konnte den Primärindex nicht der zweiten Datei hinzufügen.

source: Could not compile regular expression to select fields.
de: Konnte regulären Ausdruck nicht übersetzen.

source: Allocate memory for array of selected fields.
de: Alloziere Speicher für Array der selektierten Felder.

source: Primary key could not be found in the first database.
de: Primärschlüssel konnte in erster Datenbank nicht gefunden werden.

source: Primary key is not in list of selected fields of the first database.
de: Primärschlüssel ist nicht in der Liste ausgewählter Felder der ersten Datenbank.

source: Primary key could not be found in the second database.
de: Primärschlüssel konnte in zweiter Datenbank nicht gefunden werden.

source: Primary key is not in list of selected fields of the second database.
de: Primärschlüssel ist nicht in der Liste ausgewählter Felder der zweiten Datenbank.

source: Primary keys have different length in databases.
de: Primärschlüssel haben unterschiedliche Länge in den Datenbanken.

source: -File Version: %1.1f
de: -Datei Version: %1.1f

source: +File Version: %1.1f
de: +Datei Version: %1.1f

source: -File Type: %d
de: -Dateityp: %d

source: +File Type: %d
de: +Dateityp: %d

source: -Tablename: %s
de: -Tabellenname: %s

source: +Tablename: %s
de: +Tabellenname: %s

source: -Num. of Records: %d
de: -Anzahl der Datensätze: %d

source: +Num. of Records: %d
de: +Anzahl der Datensätze: %d

source: -Num. of Fields: %d
de: -Anzahl der Felder: %d

source: +Num. of Fields: %d
de: +Anzahl der Felder: %d

source: Allocate memory for lcs array.
de: Alloziere Speicher für lcs-Array.

source: Allocate memory for lines in lcs array.
de: Alloziere Speicher für Zeilen in lcs-Array.

source: Allocate memory for array of field pointers.
de: Alloziere Speicher für Array der Felder-Zeiger.

source: Allocate memory for record.
de: Alloziere Speicher für Datensatz.

source: Allocate memory for array of records.
de: Alloziere Speicher für Array der Felder-Zeiger.

source: Could not get record number %d
de: Konnte auf Datensatz Nummer %d nicht zugreifen.

source: %d records deleted.
de: %d Datensätze gelöscht.

source: %d records added.
de: %d Datensätze hinzugefügt.

source: %d records updated.
de: %d Datensätze aktualisiert.

source: %d identical records.
de: %d indentische Datensätze.

source: Schema already differs, will not compare records.
de: Tabellenstruktur unterscheidet sich, Datensätze werden nicht verglichen.
